#+TITLE: Emacs From Scratch Configuration
#+PROPERTY: header-args:emacs-lisp :tangle ./init.el :mkdirp yes
#+STARTUP: overview

** 基本配置 Basic Config

This section contains the basic configuration for =org-mode= plus the configuration for Org agendas and capture templates.  There's a lot to unpack in here so I'd recommend watching the videos for [[https://youtu.be/VcgjTEa0kU4][Part 5]] and [[https://youtu.be/PNE-mgkZ6HM][Part 6]] for a full explanation.

#+begin_src emacs-lisp

  (defun efs/org-mode-setup ()
    (org-indent-mode)
    (variable-pitch-mode 1)
    (visual-line-mode 1))

  (use-package org
    :pin org
    :commands (org-capture org-agenda)
    :hook (org-mode . efs/org-mode-setup)
    :config
    (setq org-ellipsis " ▾")

    (setq org-agenda-start-with-log-mode t)
    (setq org-log-done 'time)
    (setq org-log-into-drawer t)

    (require 'org-habit)
    (add-to-list 'org-modules 'org-habit)
    (setq org-habit-graph-column 60)

    ;; Save Org buffers after refiling!
    (advice-add 'org-refile :after 'org-save-all-org-buffers)

    (define-key global-map (kbd "C-c j")
      (lambda () (interactive) (org-capture nil "xh")))

    (efs/org-font-setup))

#+end_src

#+RESULTS:
| org-fancy-priorities-mode | org-superstar-mode | org-tempo-setup | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-show-all append local] 5] | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-babel-show-result-all append local] 5] | org-babel-result-hide-spec | org-babel-hide-all-hashes | (lambda nil (add-hook 'after-save-hook #'efs/org-babel-tangle-config)) | efs/org-mode-visual-fill | org-bullets-mode | efs/org-mode-setup | (lambda nil (display-line-numbers-mode 0)) |

* 个人信息
#+begin_src emacs-lisp
(setq bookmark-default-file "~/.dotfiles/custom/emacs/bookmarks-default.el")
(setq custom-theme-directory "~/.dotfiles/custom/emacs/themes/")
(setq user-full-name "Xing Wenju"
      user-mail-address "linuxing3@qq.com")
(setq browse-url-browser-function 'browse-url-chromium)
#+end_src

#+RESULTS:
: ./localelpa/themes/
**** lsp-mode

We use the excellent [[https://emacs-lsp.github.io/lsp-mode/][lsp-mode]] to enable IDE-like functionality for many different programming languages via "language servers" that speak the [[https://microsoft.github.io/language-server-protocol/][Language Server Protocol]].  Before trying to set up =lsp-mode= for a particular language, check out the [[https://emacs-lsp.github.io/lsp-mode/page/languages/][documentation for your language]] so that you can learn which language servers are available and how to install them.

The =lsp-keymap-prefix= setting enables you to define a prefix for where =lsp-mode='s default keybindings will be added.  I *highly recommend* using the prefix to find out what you can do with =lsp-mode= in a buffer.

The =which-key= integration adds helpful descriptions of the various keys so you should be able to learn a lot just by pressing =C-c l= in a =lsp-mode= buffer and trying different things that you find there.

#+begin_src emacs-lisp

  (defun efs/lsp-mode-setup ()
    (setq lsp-headerline-breadcrumb-segments '(path-up-to-project file symbols))
    (lsp-headerline-breadcrumb-mode))

  (use-package lsp-mode
    ;;:load-path "./localelpa/lsp-mode"
    :commands (lsp lsp-deferred)
    :hook (lsp-mode . efs/lsp-mode-setup)
    :init
    (setq lsp-keymap-prefix "C-c l")  ;; Or 'C-l', 's-l'
    :config
    (lsp-enable-which-key-integration t))

#+end_src

#+RESULTS:
| efs/lsp-mode-setup |

**** lsp-ui

[[https://emacs-lsp.github.io/lsp-ui/][lsp-ui]] is a set of UI enhancements built on top of =lsp-mode= which make Emacs feel even more like an IDE.  Check out the screenshots on the =lsp-ui= homepage (linked at the beginning of this paragraph) to see examples of what it can do.

#+begin_src emacs-lisp
 
  (use-package lsp-ui
    ;;:load-path "./localelpa/lsp-ui"
    :hook (lsp-mode . lsp-ui-mode)
    :custom
    (lsp-ui-doc-position 'bottom))

#+end_src

#+RESULTS:
| lsp-ui-mode | efs/lsp-mode-setup |

*** [完成] go
CLOSED: [2021-11-12 周五 16:17]
#+begin_src emacs-lisp
(use-package go-mode
  :ensure t
  :hook ((go-mode . lsp-deferred))
  :config
  (require 'dap-go)
  (dap-go-setup)
  (if IS-WINDOWS (dap-register-debug-template
   "Launch Unoptimized Debug Package"
   (list :type "go"
	 :request "launch"
	 :name "Launch Unoptimized Debug Package"
	 :mode "debug"
	 :program "${workspacefolder}/main.exe"
	 :buildFlags "-gcflags '-N -l'"
	 :args nil
	 :env nil
	 :envFile nil))))

(use-package go-eldoc
  :ensure t
  :hook ((go-mode . go-eldoc-setup))
  :config
  (set-face-attribute 'eldoc-highlight-function-argument nil
                      :underline t :foreground "green"
                      :weight 'bold))

#+end_src

#+RESULTS:
| go-eldoc |

** 高亮 Highlight todo

#+begin_src emacs-lisp
(use-package hl-todo
  ;;:load-path "./localelpa/hl-todo"
  :hook (prog-mode . hl-todo-mode)
  :commands hl-todo-mode
  :config
  (setq hl-todo-highlight-punctuation ":"
        hl-todo-keyword-faces
        `(("TODO"  . ,(face-foreground 'warning))
          ("FIXME" . ,(face-foreground 'error))
          ("HACK"  . ,(face-foreground 'font-lock-constant-face))
          ("REVIEW"  . ,(face-foreground 'font-lock-keyword-face))
          ("NOTE"  . ,(face-foreground 'success))
          ("DEPRECATED" . ,(face-foreground 'font-lock-doc-face))))
  (when hl-todo-mode
        (hl-todo-mode -1)
        (hl-todo-mode +1)))
#+end_src

#+RESULTS:
| hl-todo-mode | rainbow-delimiters-mode |

** format 

#+begin_src emacs-lisp
(use-package format-all
  :hook
  (prog-mode . format-all-mode))
#+end_src

#+RESULTS:
| format-all-mode | rainbow-delimiters-mode | hl-todo-mode |

